lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
    struct _detector_base_t
    {
      virtual bool detect(_detector_result_t* result, bool use_reset) const = 0;
      virtual void setup(_detector_result_t* result) const = 0;

    protected:

      class _pin_backup_t
      {
      public:
        _pin_backup_t(int8_t pin_num)
        : _pin_num { static_cast<gpio_num_t>(pin_num) }
        {
          if (pin_num >= 0)
          {
            _io_mux_gpio_reg   = *reinterpret_cast<uint32_t*>(GPIO_PIN_MUX_REG[pin_num]);
            _gpio_pin_reg      = *reinterpret_cast<uint32_t*>(GPIO_PIN0_REG              + (pin_num * 4));
            _gpio_func_out_reg = *reinterpret_cast<uint32_t*>(GPIO_FUNC0_OUT_SEL_CFG_REG + (pin_num * 4));
#if defined ( GPIO_ENABLE1_REG )
            _gpio_enable = *reinterpret_cast<uint32_t*>(((_pin_num & 32) ? GPIO_ENABLE1_REG : GPIO_ENABLE_REG)) & (1 << (_pin_num & 31));
#else
            _gpio_enable = *reinterpret_cast<uint32_t*>(GPIO_ENABLE_REG) & (1 << (_pin_num & 31));
#endif
          }
        }

        void restore(void) const
        {
          if ((int)_pin_num >= 0) {
  // ESP_LOGD("DEBUG","restore pin:%d ", _pin_num);
  // ESP_LOGD("DEBUG","restore IO_MUX_GPIO0_REG          :%08x -> %08x ", *reinterpret_cast<uint32_t*>(GPIO_PIN_MUX_REG[_pin_num]                 ), _io_mux_gpio_reg   );
  // ESP_LOGD("DEBUG","restore GPIO_PIN0_REG             :%08x -> %08x ", *reinterpret_cast<uint32_t*>(GPIO_PIN0_REG              + (_pin_num * 4)), _gpio_pin_reg      );
  // ESP_LOGD("DEBUG","restore GPIO_FUNC0_OUT_SEL_CFG_REG:%08x -> %08x ", *reinterpret_cast<uint32_t*>(GPIO_FUNC0_OUT_SEL_CFG_REG + (_pin_num * 4)), _gpio_func_out_reg );
            *reinterpret_cast<uint32_t*>(GPIO_PIN_MUX_REG[_pin_num]) = _io_mux_gpio_reg;
            *reinterpret_cast<uint32_t*>(GPIO_PIN0_REG              + (_pin_num * 4)) = _gpio_pin_reg;
            *reinterpret_cast<uint32_t*>(GPIO_FUNC0_OUT_SEL_CFG_REG + (_pin_num * 4)) = _gpio_func_out_reg;
#if defined ( GPIO_ENABLE1_REG )
            auto gpio_enable_reg = reinterpret_cast<uint32_t*>(((_pin_num & 32) ? GPIO_ENABLE1_REG : GPIO_ENABLE_REG));
#else
            auto gpio_enable_reg = reinterpret_cast<uint32_t*>(GPIO_ENABLE_REG);
#endif

            uint32_t pin_mask = 1 << (_pin_num & 31);
  // ESP_LOGD("DEBUG","restore GPIO_ENABLE_REG:%08x", *gpio_enable_reg);
            if (_gpio_enable)
            {
              *gpio_enable_reg |= pin_mask;
            }
            else
            {
              *gpio_enable_reg &= ~pin_mask;
            }
  // ESP_LOGD("DEBUG","restore GPIO_ENABLE_REG:%08x", *gpio_enable_reg);
          }
        }

      private:
        uint32_t _io_mux_gpio_reg;
        uint32_t _gpio_pin_reg;
        uint32_t _gpio_func_out_reg;
        gpio_num_t _pin_num;
        bool _gpio_enable;
      };

      static void _pin_level(int_fast16_t pin, bool level)
      {
        if (pin < 0) return;

        lgfx::pinMode(pin, lgfx::pin_mode_t::output);
        if (level) lgfx::gpio_hi(pin);
        else       lgfx::gpio_lo(pin);
      }

      static void _pin_reset(int_fast16_t pin, bool use_reset)
      {
        if (pin < 0) return;

        lgfx::gpio_hi(pin);
        lgfx::pinMode(pin, lgfx::pin_mode_t::output);
        if (!use_reset) return;
        lgfx::gpio_lo(pin);
        auto time = lgfx::millis();
        do
        {
          lgfx::delay(1);
        } while (lgfx::millis() - time < 2);
          lgfx::gpio_hi(pin);
        time = lgfx::millis();
        do
        {
          lgfx::delay(1);
        } while (lgfx::millis() - time < 10);
      }

      /// TF card dummy clock送信 ;
      static void _send_sd_dummy_clock(int spi_host, int_fast16_t pin_cs)
      {
        static constexpr uint32_t dummy_clock[] = { ~0u, ~0u, ~0u, ~0u };
        _pin_level(pin_cs, true);
        lgfx::spi::writeBytes(spi_host, (const uint8_t*)dummy_clock, sizeof(dummy_clock));
        _pin_level(pin_cs, false);
      }

      /// TF card をSPIモードに移行する ;
      static void _set_sd_spimode(int spi_host, int_fast16_t pin_cs)
      {
        lgfx::spi::beginTransaction(spi_host, 400000, 0);
        _send_sd_dummy_clock(spi_host, pin_cs);

        uint8_t sd_cmd58[] = { 0x7A, 0, 0, 0, 0, 0xFD, 0xFF, 0xFF }; // READ_OCR command.
        lgfx::spi::readBytes(spi_host, sd_cmd58, sizeof(sd_cmd58));

  // ESP_LOGW(LIBRARY_NAME, "SD READ_OCR: %02x %02x", sd_cmd58[6], sd_cmd58[7]);
        if (sd_cmd58[6] == sd_cmd58[7])  // not SPI mode
        {
          _send_sd_dummy_clock(spi_host, pin_cs);

          static constexpr uint8_t sd_cmd0[] = { 0x40, 0, 0, 0, 0, 0x95, 0xFF, 0xFF }; // GO_IDLE_STATE command.
          lgfx::spi::writeBytes(spi_host, sd_cmd0, sizeof(sd_cmd0));
        }
        _pin_level(pin_cs, true);
        lgfx::spi::endTransaction(spi_host);
      }

      static uint32_t _read_panel_id(lgfx::IBus* bus, int32_t pin_cs, uint_fast16_t cmd = 0x04, uint8_t dummy_read_bit = 1) // 0x04 = RDDID command
      {
        size_t dlen = 8;
        uint_fast16_t read_cmd = cmd;
        if (bus->busType() == bus_type_t::bus_parallel16)
        {
          dlen = 16;
          read_cmd = getSwap16(read_cmd);
        }

        bus->beginTransaction();
        _pin_level(pin_cs, true);
        bus->writeCommand(0, dlen);
        bus->wait();

        _pin_level(pin_cs, false);
        bus->writeCommand(read_cmd, dlen);
        bus->beginRead(dummy_read_bit);
        uint32_t res = 0;
        for (size_t i = 0; i < 4; ++i)
        {
          res += ((bus->readData(dlen) >> (dlen - 8)) & 0xFF) << (i * 8);
        }
        bus->endTransaction();
        _pin_level(pin_cs, true);

        ESP_LOGV(LIBRARY_NAME, "[Autodetect] read cmd:%02x = %08x", (unsigned int)cmd, (unsigned int)res);
        return res;
      }

      static ILight* _create_pwm_backlight(int16_t pin, uint8_t ch, uint32_t freq = 12000, bool invert = false, uint8_t offset = 0)
      {
        auto bl = new lgfx::Light_PWM();
        auto cfg = bl->config();
        cfg.pin_bl = pin;
        cfg.freq   = freq;
        cfg.pwm_channel = ch;
        cfg.offset = offset;
        cfg.invert = invert;
        bl->config(cfg);
        return bl;
      }
    };

    struct _detector_t : public _detector_base_t
    {
      board_t board = board_t::board_unknown;
      uint16_t id_cmd;
      uint32_t id_mask;
      uint32_t id_value;
      uint32_t freq_write;
      uint32_t freq_read;

      constexpr _detector_t (board_t board_, uint16_t id_cmd_, uint32_t id_mask_, uint32_t id_value_, uint32_t freq_write_, uint32_t freq_read_ )
      : board      { board_      }
      , id_cmd     { id_cmd_     }
      , id_mask    { id_mask_    }
      , id_value   { id_value_   }
      , freq_write { freq_write_ }
      , freq_read  { freq_read_  }
      {}

      virtual bool judgement(IBus* bus, int pin_cs) const
      {
        bool hit = true;
        if (id_mask) {
          hit = (id_value == (_read_panel_id(bus, pin_cs, id_cmd) & id_mask));
          if (hit && id_value == 0 && id_cmd == 0x04)
          {
            hit = (0 != (_read_panel_id(bus, pin_cs, 0x09) & 0xFFFFFF));
          }
        }
        return hit;
      }
    };

    struct _detector_spi_t : public _detector_t
    {
      union
      {
        struct {
          int8_t pin_mosi;
          int8_t pin_miso;
          int8_t pin_sclk;
          int8_t pin_dc;
          int8_t pin_cs;
          int8_t pin_rst;
          int8_t pin_tfcard_cs;
        };
        int8_t pins[7];
      };
      int8_t spi_mode;
      bool spi_3wire;
      spi_host_device_t spi_host;

      constexpr _detector_spi_t
      ( board_t board_
      , uint16_t id_cmd_
      , uint32_t id_mask_
      , uint32_t id_value_
      , uint32_t freq_write_
      , uint32_t freq_read_
      , gpio_num_t pin_mosi_
      , gpio_num_t pin_miso_
      , gpio_num_t pin_sclk_
      , gpio_num_t pin_dc_
      , gpio_num_t pin_cs_
      , gpio_num_t pin_rst_
      , gpio_num_t pin_tfcard_cs_
      , int8_t spi_mode_
      , bool spi_3wire_
      , spi_host_device_t spi_host_
      )
      : _detector_t { board_, id_cmd_, id_mask_, id_value_, freq_write_, freq_read_ }
      ,  pins       { pin_mosi_, pin_miso_, pin_sclk_, pin_dc_, pin_cs_, pin_rst_, pin_tfcard_cs_ }
      ,  spi_mode   { spi_mode_   }
      ,  spi_3wire  { spi_3wire_  }
      ,  spi_host   { spi_host_   }
      {}

      bool detect(_detector_result_t* result, bool use_reset) const override
      {
        if (result->board && result->board != board)
        {
          return false;
        }
        _pin_backup_t backup[7] =
        { pins[0], pins[1], pins[2], pins[3], pins[4], pins[5], pins[6] };

        _pin_level(pin_cs, true);

        Bus_SPI bus_spi;
        auto bus_cfg = bus_spi.config();
        bus_cfg.freq_write  = 8000000;
        bus_cfg.freq_read   = 8000000;
        bus_cfg.use_lock    = true;

