lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
// パネル検出時点ではDMAを使用しない設定にしておく。
// これはバスをリリースしてもDPORT_SPI_DMA_CHAN_SEL_REGの値がクリアされず、
// 次回DMA設定時に動作に支障が出ることがあるため。
        bus_cfg.dma_channel = 0;
        bus_cfg.spi_host    = spi_host;
        bus_cfg.pin_mosi    = pin_mosi;
        bus_cfg.pin_miso    = pin_miso;
        bus_cfg.pin_sclk    = pin_sclk;
        bus_cfg.pin_dc      = pin_dc;
        bus_cfg.spi_mode    = spi_mode;
        bus_cfg.spi_3wire   = spi_3wire;
        bus_spi.config(bus_cfg);
        bus_spi.init();
        _pin_reset(pin_rst, use_reset); // LCD RST

        if ((int)pin_tfcard_cs >= 0) {
          _set_sd_spimode(spi_host, pin_tfcard_cs);
        }

        bool hit = judgement(&bus_spi, pin_cs);

        bus_spi.release();

        if (hit)
        {
          bus_cfg.dma_channel = 1;
#if defined (ESP_IDF_VERSION)
 #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 3, 0)
          bus_cfg.dma_channel = SPI_DMA_CH_AUTO;
 #endif
#endif
          bus_cfg.freq_write = freq_write;
          bus_cfg.freq_read  = freq_read;
          auto bus = new Bus_SPI();
          bus->config(bus_cfg);
          result->bus = bus;
          result->board = board;
          setup(result);
          auto p = result->panel;
          p->bus(bus);
          {
            auto cfg = p->config();
            if (pin_cs  >= 0) { cfg.pin_cs  = pin_cs;  }
            if (pin_rst >= 0) { cfg.pin_rst = pin_rst; }
            p->config(cfg);
          }
          return true;
        }

        for (auto &b : backup)
        {
          b.restore();
        }

        return false;
      }
    };

#if defined (CONFIG_IDF_TARGET_ESP32S2) || defined (CONFIG_IDF_TARGET_ESP32S3)

    struct _detector_parallel16_t : public _detector_t
    {
      union
      {
        struct {
          int8_t pin_data[16];
          int8_t pin_wr;
          int8_t pin_rd;
          int8_t pin_rs;
          int8_t pin_cs;
          int8_t pin_rst;
        };
        int8_t pins[21];
      };
      int8_t port;


      constexpr _detector_parallel16_t
      ( board_t board_
      , uint16_t id_cmd_
      , uint32_t id_mask_
      , uint32_t id_value_
      , uint32_t freq_write_
      , uint32_t freq_read_
      , gpio_num_t pin_d0_ , gpio_num_t pin_d1_ , gpio_num_t pin_d2_ , gpio_num_t pin_d3_ , gpio_num_t pin_d4_ , gpio_num_t pin_d5_ , gpio_num_t pin_d6_ , gpio_num_t pin_d7_
      , gpio_num_t pin_d8_ , gpio_num_t pin_d9_ , gpio_num_t pin_d10_, gpio_num_t pin_d11_, gpio_num_t pin_d12_, gpio_num_t pin_d13_, gpio_num_t pin_d14_, gpio_num_t pin_d15_
      , gpio_num_t pin_wr_
      , gpio_num_t pin_rd_
      , gpio_num_t pin_rs_
      , gpio_num_t pin_cs_
      , gpio_num_t pin_rst_
      , int8_t port_
      )
      : _detector_t { board_, id_cmd_, id_mask_, id_value_, freq_write_, freq_read_ }
      , pins       { pin_d0_, pin_d1_, pin_d2_, pin_d3_, pin_d4_, pin_d5_, pin_d6_, pin_d7_
                   , pin_d8_, pin_d9_, pin_d10_, pin_d11_, pin_d12_, pin_d13_, pin_d14_, pin_d15_
                   , pin_wr_, pin_rd_, pin_rs_, pin_cs_, pin_rst_ }
      , port       { port_     }
      {}

      bool detect(_detector_result_t* result, bool use_reset) const override
      {
        if (result->board && result->board != board)
        {
          return false;
        }

        _pin_backup_t backup[] =
        { pins[ 0], pins[ 1], pins[ 2], pins[ 3], pins[ 4], pins[ 5], pins[ 6], pins[ 7],
          pins[ 8], pins[ 9], pins[10], pins[11], pins[12], pins[13], pins[14], pins[15],
          pins[16], pins[17], pins[18], pins[19], pins[20]
        };

        _pin_level(pin_cs, true);

        Bus_Parallel16 bus_tmp;
        auto cfg = bus_tmp.config();
        for (size_t i = 0; i < 16; ++i)
        {
          cfg.pin_data[i] = pin_data[i];
        }
        cfg.pin_wr = pin_wr;
        cfg.pin_rd = pin_rd;
        cfg.pin_rs = pin_rs;
        cfg.freq_write = 5000000;
        // cfg.freq_read = 5000000;
        cfg.port   = port;

        bus_tmp.config(cfg);
        bus_tmp.init();
        _pin_reset(pin_rst, use_reset); // LCD RST

        bool hit = judgement(&bus_tmp, pin_cs);

        bus_tmp.release();

        if (hit)
        {
          auto bus = new Bus_Parallel16();

          cfg.freq_write = freq_write;
          // cfg.freq_read = freq_read;
          cfg.port   = port;

          bus->config(cfg);
          result->bus = bus;
          result->board = board;
          setup(result);
          auto p = result->panel;
          p->bus(bus);
          {
            auto cfg_panel = p->config();
            if (pin_cs  >= 0) { cfg_panel.pin_cs  = pin_cs;  }
            if (pin_rst >= 0) { cfg_panel.pin_rst = pin_rst; }
            p->config(cfg_panel);
          }
          return true;
        }

        for (auto &b : backup)
        {
          b.restore();
        }

        return false;
      }
    };

#endif // (CONFIG_IDF_TARGET_ESP32S2) || defined (CONFIG_IDF_TARGET_ESP32S3)

    lgfx::Panel_Device* _panel_last = nullptr;
    lgfx::ILight* _light_last = nullptr;
    lgfx::ITouch* _touch_last = nullptr;
    lgfx::IBus* _bus_last = nullptr;

    bool init_impl(bool use_reset, bool use_clear)
    {
      static constexpr char NVS_KEY[] = "AUTODETECT";
      uint32_t nvs_board = 0;
      uint32_t nvs_handle = 0;
      if (0 == nvs_open(LIBRARY_NAME, NVS_READONLY, &nvs_handle))
      {
        nvs_get_u32(nvs_handle, NVS_KEY, static_cast<uint32_t*>(&nvs_board));
        nvs_close(nvs_handle);
        ESP_LOGI(LIBRARY_NAME, "[Autodetect] load from NVS : board:%d", (int)nvs_board);
      }

#if defined ( LGFX_DEFAULT_BOARD )
      if (0 == nvs_board)
      {
        nvs_board = LGFX_DEFAULT_BOARD;
      }
#endif

      auto board = (board_t)nvs_board;

      int retry = 4;
      do
      {
        if (retry == 1) use_reset = true;
        board = autodetect(use_reset, board);
        //ESP_LOGI(LIBRARY_NAME,"autodetect board:%d", board);
      } while (board_t::board_unknown == board && --retry >= 0);
      _board = board;
      /// autodetectの際にreset済みなのでここではuse_resetをfalseで呼び出す。
      bool res = LGFX_Device::init_impl(false, use_clear);

