lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
      if (nvs_board != board) {
        if (0 == nvs_open(LIBRARY_NAME, NVS_READWRITE, &nvs_handle)) {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] save to NVS : board:%d", board);
          nvs_set_u32(nvs_handle, NVS_KEY, board);
          nvs_close(nvs_handle);
        }
      }
      return res;
    }

  public:

    board_t autodetect(bool use_reset = true, board_t board = board_t::board_unknown)
    {
#if defined (CONFIG_IDF_TARGET_ESP32S3)

      struct _detector_M5AtomS3_t : public _detector_spi_t
      {
        constexpr _detector_M5AtomS3_t(void) :
        _detector_spi_t
        { board_t::board_M5AtomS3
        , 0x04, 0xFFFFFF, 0x079100  // GC9107
        , 40000000, 16000000
        , GPIO_NUM_21     // MOSI
        , GPIO_NUM_13     // MISO
        , GPIO_NUM_17     // SCLK
        , GPIO_NUM_33     // DC
        , GPIO_NUM_15     // CS
        , GPIO_NUM_34     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , SPI3_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* param) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5AtomS3");
          auto p = new Panel_GC9107();
          param->panel = p;
          p->light(_create_pwm_backlight(GPIO_NUM_16, 7, 256, false, 48));

          {
            auto cfg = p->config();
            cfg.panel_width = 128;
            cfg.panel_height = 128;
            cfg.offset_y = 32;
            p->config(cfg);
          }
        }
      };

      struct _detector_M5StackCoreS3_t : public _detector_spi_t
      {
        constexpr _detector_M5StackCoreS3_t(void) :
        _detector_spi_t
        { board_t::board_M5StackCoreS3
        , 0x04, 0xFF, 0xE3 // ILI9342C
        , 40000000, 20000000
        , GPIO_NUM_37     // MOSI
        , GPIO_NUM_35     // MISO
        , GPIO_NUM_36     // SCLK
        , GPIO_NUM_35     // DC
        , GPIO_NUM_3      // CS
        , (gpio_num_t)-1  // RST
        , GPIO_NUM_4      // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , SPI2_HOST       // SPI HOST
        } {}

        bool detect(_detector_result_t* result, bool use_reset) const override
        {
          using namespace m5stack;

          _pin_backup_t backup[] = { i2c_sda, i2c_scl };

          lgfx::i2c::init(i2c_port, i2c_sda, i2c_scl);

    // ESP_LOGI("DEBUG","AW 0x10 :%02x ", lgfx::i2c::readRegister8(i2c_port, aw9523_i2c_addr, 0x10, 400000).value());
    // ESP_LOGI("DEBUG","AXP0x03 :%02x ", lgfx::i2c::readRegister8(i2c_port, axp_i2c_addr, 0x03, 400000).value());

          auto chk_axp = lgfx::i2c::readRegister8(i2c_port, axp_i2c_addr, 0x03, i2c_freq);
          if (chk_axp.has_value() && chk_axp.value() == 0x4A)
          {
            auto chk_aw  = lgfx::i2c::readRegister8(i2c_port, aw9523_i2c_addr, 0x10, i2c_freq);
            if (chk_aw .has_value() && chk_aw .value() == 0x23)
            {
              static constexpr const uint8_t axp_reg_set[] = {
                0x90, 0xBF,           // LDOS ON/OFF control 0
                0x95, 0x28,           // ALDO3 set to 3.3v // for TF card slot
                0x96, (0b11110 - 7),  // BLDO1 => CAM AVDD 2.8V
                0x97, (0b00000 + 7),  // BLDO2 => CAM DVDD 1.2V
              };
              for (size_t i = 0; i < sizeof(axp_reg_set); i += 2) {
                lgfx::i2c::writeRegister8(i2c_port, axp_i2c_addr, axp_reg_set[i], axp_reg_set[i+1]);
              }

              lgfx::i2c::bitOn(i2c_port, aw9523_i2c_addr, 0x02, 0b00000101); //port0 output ctrl
              lgfx::i2c::bitOn(i2c_port, aw9523_i2c_addr, 0x03, 0b00000011); //port1 output ctrl

              static constexpr const uint8_t aw9523_reg_set[] = {
                0x04, 0b00011000,     // CONFIG_P0
                0x05, 0b00001100,     // CONFIG_P1
                0x11, 0b00010000,     // GCR P0 port is Push-Pull mode.
                0x12, 0b11111111,     // LEDMODE_P0
                0x13, 0b11111111,     // LEDMODE_P1
              };
              for (size_t i = 0; i < sizeof(aw9523_reg_set); i += 2) {
                lgfx::i2c::writeRegister8(i2c_port, aw9523_i2c_addr, aw9523_reg_set[i], aw9523_reg_set[i+1]);
              }

              if (_detector_spi_t::detect(result, use_reset))
              {
                return true;
              }
            }
          }
          lgfx::i2c::release(i2c_port);

          for (auto &b : backup)
          {
            b.restore();
          }

          return false;
        }

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5StackCoreS3");
          auto p = new Panel_M5StackCoreS3();
          result->panel = p;
          p->light(new Light_M5StackCoreS3());
          p->touch(new lgfx::Touch_M5StackCoreS3());
        }
      };

      struct _detector_ESP32_S3_BOX_t : public _detector_spi_t
      {
        constexpr _detector_ESP32_S3_BOX_t(void) :
        _detector_spi_t
        { board_t::board_ESP32_S3_BOX
        , 0x04, 0xFF, 0xE3 // ILI9342C
        , 40000000, 16000000
        , GPIO_NUM_6      // MOSI
        , GPIO_NUM_0      // MISO
        , GPIO_NUM_7      // SCLK
        , GPIO_NUM_4      // DC
        , GPIO_NUM_5      // CS
        , GPIO_NUM_48     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , SPI2_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] ESP32_S3_BOX");
          auto p = new Panel_ILI9342();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.offset_rotation = 1;
            p->config(cfg);    // config設定;
            p->setRotation(1); // config設定後に向きを設定;
            p->light(_create_pwm_backlight(GPIO_NUM_45, 0, 12000));
          }

          {
            auto t = new lgfx::Touch_TT21xxx();
            auto cfg = t->config();
            cfg.pin_int  = GPIO_NUM_3;
            cfg.pin_sda  = GPIO_NUM_8;
            cfg.pin_scl  = GPIO_NUM_18;
            cfg.i2c_addr = 0x24;
            cfg.i2c_port = I2C_NUM_1;
            cfg.freq = 400000;
            cfg.x_min = 0;
            cfg.x_max = 319;
            cfg.y_min = 0;
            cfg.y_max = 239;
            cfg.bus_shared = false;
            t->config(cfg);
            p->touch(t);
            float affine[6] = { 1, 0, 0, 0, -1, 240 };
            p->setCalibrateAffine(affine);
          }
        }
      };

      struct _detector_ESP32_S3_BOX_Lite_t : public _detector_spi_t
      {
        constexpr _detector_ESP32_S3_BOX_Lite_t(void) :
        _detector_spi_t
        { board_t::board_ESP32_S3_BOX_Lite
        , 0x04, 0xFFFFFF, 0x528585 // ST7789V
        , 80000000, 16000000
        , GPIO_NUM_6      // MOSI
        , GPIO_NUM_0      // MISO
        , GPIO_NUM_7      // SCLK
        , GPIO_NUM_4      // DC
        , GPIO_NUM_5      // CS
        , GPIO_NUM_48     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , SPI2_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] ESP32_S3_BOX_Lite");
          auto p = new Panel_ST7789();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.invert = true;
            cfg.offset_rotation = 2;
            p->config(cfg);
            p->setRotation(1);
            p->light(_create_pwm_backlight(GPIO_NUM_45, 0, 12000, true));
          }
        }
      };


      struct _detector_ESP32_S3_BOX_V3_t : public _detector_spi_t
      {
        constexpr _detector_ESP32_S3_BOX_V3_t(void) :
        _detector_spi_t
        { board_t::board_ESP32_S3_BOX_V3
          , 0x04, 0xff, 0xE3 // ILI9342C
          , 40000000, 16000000
          , GPIO_NUM_6      // MOSI
          , (gpio_num_t)-1  // MISO
          , GPIO_NUM_7      // SCLK
          , GPIO_NUM_4      // DC
          , GPIO_NUM_5      // CS
          , (gpio_num_t)-1  // RST
          , (gpio_num_t)-1  // TF CARD CS
          , 0               // SPI MODE
          , true            // SPI 3wire
          , SPI2_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] ESP32_S3_BOX_V3");
          lgfx::pinMode(GPIO_NUM_48, lgfx::pin_mode_t::input_pullup);
          auto p = new Panel_ILI9342();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.offset_rotation = 1;
            p->config(cfg);    // config設定;
            p->setRotation(1); // config設定後に向きを設定;
            p->light(_create_pwm_backlight(GPIO_NUM_47, 0, 12000));
          }

          {
            auto t = new lgfx::Touch_GT911();
            auto cfg = t->config();
            cfg.pin_int  = GPIO_NUM_3;
            cfg.pin_sda  = GPIO_NUM_8;
            cfg.pin_scl  = GPIO_NUM_18;
            cfg.i2c_addr = 0x14;
            cfg.i2c_port = I2C_NUM_0;
            cfg.x_min    = 0;
            cfg.x_max    = 319;
            cfg.y_min    = 0;
            // Max-y = 239 + 40 pixels for "red" touch point below LCD active area
            cfg.y_max    = 279;
            cfg.offset_rotation = 2;
            cfg.bus_shared = false;
            t->config(cfg);
            if (!t->init())
            {
              cfg.i2c_addr = 0x5D; // addr change (0x14 or 0x5D)
              t->config(cfg);
            }
            p->touch(t);
          }
        }
      };


      struct _detector_Makerfabs_ESP32_S3_TFT_Touch_SPI_t : public _detector_spi_t
      {
        constexpr _detector_Makerfabs_ESP32_S3_TFT_Touch_SPI_t(void) :
        _detector_spi_t
        { board_t::board_Makerfabs_ESP32_S3_TFT_Touch_SPI
        , 0x04, 0xFFFFFF, 0x668054 // ILI9488
        , 40000000, 20000000
        , GPIO_NUM_13     // MOSI
        , GPIO_NUM_12     // MISO
        , GPIO_NUM_14     // SCLK
        , GPIO_NUM_21     // DC
        , GPIO_NUM_15     // CS
        , (gpio_num_t)-1  // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , SPI3_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Makerfabs_ESP32_S3_TFT_Touch_SPI");

          // disable pull-up for MISO pin.
          PIN_PULLUP_DIS(IO_MUX_GPIO12_REG);

          auto p = new Panel_ILI9488();
          result->panel = p;
          {
            auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_15;
            cfg.bus_shared = false;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_48, 0, 12000));
          }

          {
            auto t = new lgfx::Touch_FT5x06();
            auto cfg = t->config();
            cfg.pin_sda  = GPIO_NUM_38;
            cfg.pin_scl  = GPIO_NUM_39;
            cfg.pin_int  = GPIO_NUM_40;
            cfg.i2c_addr = 0x38;
            cfg.i2c_port = I2C_NUM_0;
            cfg.freq = 400000;
            cfg.x_min = 0;
            cfg.x_max = 319;
            cfg.y_min = 0;
            cfg.y_max = 479;
            cfg.bus_shared = false;
            t->config(cfg);
            p->touch(t);
          }
        }
      };

