lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
      // https://github.com/Makerfabs/Makerfabs-ESP32-S3-Parallel-TFT-with-Touch/
      struct _detector_Makerfabs_ESP32_S3_TFT_Touch_Parallel16_t : public _detector_parallel16_t
      {
        constexpr _detector_Makerfabs_ESP32_S3_TFT_Touch_Parallel16_t(void) :
        _detector_parallel16_t
        { board_t::board_Makerfabs_ESP32_S3_TFT_Touch_Parallel16
        , 0x04, 0xFF, 0x54 // ILI9488
        , 40000000, 16000000
        // DATA 0 - 7
        , GPIO_NUM_47, GPIO_NUM_21, GPIO_NUM_14, GPIO_NUM_13, GPIO_NUM_12, GPIO_NUM_11, GPIO_NUM_10, GPIO_NUM_9
        // DATA 8-15
        , GPIO_NUM_3 , GPIO_NUM_8 , GPIO_NUM_16, GPIO_NUM_15, GPIO_NUM_7 , GPIO_NUM_6 , GPIO_NUM_5 , GPIO_NUM_4
        , GPIO_NUM_35     // WR
        , GPIO_NUM_48     // RD
        , GPIO_NUM_36     // RS
        , GPIO_NUM_37     // CS
        , (gpio_num_t)-1  // RST
        , 0               // peripheral port
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Makerfabs_ESP32_S3_TFT_Touch_Parallel16");
          auto p = new Panel_ILI9488();
          result->panel = p;
          {
            auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_37;
            cfg.bus_shared = false;
            cfg.dlen_16bit = true;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_45, 0, 12000));
          }

          {
            auto t = new lgfx::Touch_FT5x06();
            auto cfg = t->config();
            cfg.pin_sda  = GPIO_NUM_38;
            cfg.pin_scl  = GPIO_NUM_39;
            cfg.pin_int  = GPIO_NUM_40;
            cfg.i2c_addr = 0x38;
            cfg.i2c_port = I2C_NUM_0;
            cfg.freq = 400000;
            cfg.x_min = 0;
            cfg.x_max = 319;
            cfg.y_min = 0;
            cfg.y_max = 479;
            cfg.bus_shared = false;
            t->config(cfg);
            p->touch(t);
          }
        }
      };

      // https://github.com/W00ng/ESP32-S3-HMI-DevKit/blob/master/components/bsp/include/bsp_board.h
      struct _detector_wywy_ESP32S3_HMI_DevKit_t : public _detector_parallel16_t
      {
        constexpr _detector_wywy_ESP32S3_HMI_DevKit_t(void) :
        _detector_parallel16_t
        { board_t::board_wywy_ESP32S3_HMI_DevKit
        , 0xDB00, 0xFF, 0x82 // RM68120
        , 30000000, 16000000
        // DATA 0 - 7
        , GPIO_NUM_1 , GPIO_NUM_9 , GPIO_NUM_2 , GPIO_NUM_10, GPIO_NUM_3 , GPIO_NUM_11, GPIO_NUM_4 , GPIO_NUM_12
        // DATA 8-15
        , GPIO_NUM_5 , GPIO_NUM_13, GPIO_NUM_6 , GPIO_NUM_14, GPIO_NUM_7 , GPIO_NUM_15, GPIO_NUM_8 , GPIO_NUM_16
        , GPIO_NUM_17     // WR
        , GPIO_NUM_21     // RD
        , GPIO_NUM_38     // RS
        , (gpio_num_t)-1  // CS
        , GPIO_NUM_18     // RST
        , 0               // peripheral port
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] wywy_ESP32S3_HMI_DevKit");
          auto p = new Panel_RM68120();
          result->panel = p;
          {
            auto cfg = p->config();
            // cfg.pin_rst = GPIO_NUM_18;
            cfg.bus_shared = false;
            cfg.dlen_16bit = true;
            cfg.rgb_order = true;
            cfg.panel_width = 480;
            cfg.panel_height = 800;
            cfg.memory_width = 480;
            cfg.memory_height = 800;
            p->config(cfg);
          }

          {
            auto t = new lgfx::Touch_FT5x06();
            auto cfg = t->config();
            cfg.pin_sda  = GPIO_NUM_40;
            cfg.pin_scl  = GPIO_NUM_39;
            cfg.pin_int  = -1;
            cfg.i2c_addr = 0x38;
            cfg.i2c_port = I2C_NUM_0;
            cfg.freq = 400000;
            cfg.x_min = 0;
            cfg.x_max = 479;
            cfg.y_min = 0;
            cfg.y_max = 799;
            cfg.bus_shared = false;
            t->config(cfg);
            p->touch(t);
          }
        }
      };

      struct _detector_Feather_ESP32_S3_TFT_t : public _detector_spi_t
      {
        constexpr _detector_Feather_ESP32_S3_TFT_t(void)
        : _detector_spi_t
        { board_t::board_Feather_ESP32_S3_TFT
        , 0, 0, 0         // ID checker disable
        , 40000000, 16000000
        , GPIO_NUM_35     // MOSI
        , (gpio_num_t)-1  // MISO
        , GPIO_NUM_36     // SCLK
        , GPIO_NUM_39     // DC
        , GPIO_NUM_7      // CS
        , GPIO_NUM_40     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , SPI2_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Feather_ESP32_S3_TFT");

          lgfx::pinMode(GPIO_NUM_21, lgfx::pin_mode_t::output);
          lgfx::gpio_hi(GPIO_NUM_21); // Enable power to TFT

          auto p = new Panel_ST7789();
          result->panel = p;
          {
            auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_7;
            // cfg.pin_rst = GPIO_NUM_40;
            cfg.panel_width  = 135;
            cfg.panel_height = 240;
            cfg.offset_x = 52;
            cfg.offset_y = 40;
            cfg.readable = false;
            cfg.rgb_order = false;
            cfg.invert = true;
            cfg.offset_rotation = 1;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_45, 0, 12000));
          }
        }
      };

      struct _detector_board_LoLinS3Pro_7735_t : public _detector_spi_t
      {
        constexpr _detector_board_LoLinS3Pro_7735_t(void)
        : _detector_spi_t
        { board_t::board_LoLinS3Pro
        , 0x04, 0xFF, 0x7C // ST7735
        , 27000000, 16000000
        , GPIO_NUM_11     // MOSI
        , GPIO_NUM_13     // MISO
        , GPIO_NUM_12     // SCLK
        , GPIO_NUM_47     // DC
        , GPIO_NUM_48     // CS
        , GPIO_NUM_21     // RST
        , GPIO_NUM_46     // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , SPI2_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] LoLinS3Pro (ST7735)");

          auto p = new Panel_ST7735S();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.memory_width  = 132;
            cfg.memory_height = 132;
            cfg.panel_width  = 128;
            cfg.panel_height = 128;
            cfg.offset_x = 2;
            cfg.offset_y = 1;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_14, 0, 12000 ));
          }
        }
      };

      struct _detector_board_LoLinS3Pro_9341_t : public _detector_spi_t
      {
        constexpr _detector_board_LoLinS3Pro_9341_t(void)
        : _detector_spi_t
        { board_t::board_LoLinS3Pro
        , 0x04, 0xFF, 0x00 // ILI9341
        , 40000000, 16000000
        , GPIO_NUM_11     // MOSI
        , GPIO_NUM_13     // MISO
        , GPIO_NUM_12     // SCLK
        , GPIO_NUM_47     // DC
        , GPIO_NUM_48     // CS
        , GPIO_NUM_21     // RST
        , GPIO_NUM_46     // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , SPI2_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] LoLinS3Pro (ILI9341)");

          auto p = new Panel_ILI9341();
          result->panel = p;
          p->light(_create_pwm_backlight(GPIO_NUM_14, 0, 12000 ));

          {
            auto t = new lgfx::Touch_XPT2046();
            auto cfg = t->config();
            cfg.bus_shared = true;
            cfg.spi_host = spi_host;
            cfg.pin_cs   = GPIO_NUM_45;
            cfg.pin_mosi = pin_mosi;
            cfg.pin_miso = pin_miso;
            cfg.pin_sclk = pin_sclk;
            cfg.offset_rotation = 2;
            t->config(cfg);
            p->touch(t);
          }
        }
      };

