lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
#elif defined (CONFIG_IDF_TARGET_ESP32S2)

      // https://github.com/Makerfabs/Makerfabs-ESP32-S2-Parallel-TFT-with-Touch/
      struct _detector_Makerfabs_ESP32_S2_TFT_Touch_Parallel16_t : public _detector_parallel16_t
      {
        constexpr _detector_Makerfabs_ESP32_S2_TFT_Touch_Parallel16_t(void) :
        _detector_parallel16_t
        { board_t::board_Makerfabs_ESP32_S2_TFT_Touch_Parallel16
        , 0x04, 0xFFFFFF, 0x668054 // ILI9488
        , 27000000, 16000000
        // DATA 0 - 7
        , GPIO_NUM_33, GPIO_NUM_21, GPIO_NUM_14, GPIO_NUM_13, GPIO_NUM_12, GPIO_NUM_11, GPIO_NUM_10, GPIO_NUM_9
        // DATA 8-15
        , GPIO_NUM_3 , GPIO_NUM_8 , GPIO_NUM_16, GPIO_NUM_15, GPIO_NUM_7 , GPIO_NUM_6 , GPIO_NUM_5 , GPIO_NUM_4
        , GPIO_NUM_35     // WR
        , GPIO_NUM_34     // RD
        , GPIO_NUM_36     // RS
        , GPIO_NUM_37     // CS
        , (gpio_num_t)-1  // RST
        , 0               // peripheral port
        } {}

        void setup(_detector_result_t* result) const override
        {
          static constexpr int I2C_PORT_NUM = I2C_NUM_0;
          static constexpr int I2C_PIN_SDA = GPIO_NUM_38;
          static constexpr int I2C_PIN_SCL = GPIO_NUM_39;
          static constexpr int I2C_PIN_INT = GPIO_NUM_40;

          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Makerfabs_ESP32_S2_TFT_Touch_Parallel16");
          auto p = new Panel_ILI9488();
          result->panel = p;
          {
            auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_37;
            cfg.bus_shared = false;
            cfg.dlen_16bit = true;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_45, 7, 12000));
          }

          lgfx::ITouch::config_t cfg;
          lgfx::ITouch* touch = nullptr;
          lgfx::i2c::init(I2C_PORT_NUM, I2C_PIN_SDA, I2C_PIN_SCL);
          if (lgfx::i2c::beginTransaction(I2C_PORT_NUM, 0x38, 400000, false).has_value()
          && lgfx::i2c::endTransaction(I2C_PORT_NUM).has_value())
          {
            touch = new lgfx::Touch_FT5x06();
            cfg = touch->config();
            cfg.i2c_addr = 0x38;
            cfg.x_max = 319;
            cfg.y_max = 479;
          }
          else
          if (lgfx::i2c::beginTransaction(I2C_PORT_NUM, 0x48, 400000, false).has_value()
          && lgfx::i2c::endTransaction(I2C_PORT_NUM).has_value())
          {
            touch = new lgfx::Touch_NS2009();
            cfg = touch->config();
            cfg.i2c_addr = 0x48;
            cfg.x_min = 368;
            cfg.y_min = 212;
            cfg.x_max = 3800;
            cfg.y_max = 3800;
          }
          if (touch != nullptr)
          {
            cfg.i2c_port = I2C_PORT_NUM;
            cfg.pin_sda  = I2C_PIN_SDA;
            cfg.pin_scl  = I2C_PIN_SCL;
            cfg.pin_int  = I2C_PIN_INT;
            cfg.freq = 400000;
            cfg.bus_shared = false;
            touch->config(cfg);
            p->touch(touch);
          }
        }
      };

      // https://docs.espressif.com/projects/esp-idf/en/latest/esp32s2/hw-reference/esp32s2/user-guide-esp32-s2-kaluga-1-kit.html
      struct _detector_ESP32_S2_Kaluga_1_t : public _detector_spi_t
      {
        constexpr _detector_ESP32_S2_Kaluga_1_t(void) :
        _detector_spi_t
        { board_t::board_ESP32_S2_Kaluga_1
        , 0x04, 0xFF, 0x85 // ST7789
        , 80000000, 16000000
        , GPIO_NUM_9      // MOSI
        , GPIO_NUM_8      // MISO
        , GPIO_NUM_15     // SCLK
        , GPIO_NUM_13     // DC
        , GPIO_NUM_11     // CS
        , GPIO_NUM_16     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , SPI2_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] ESP32_S2_Kaluga_1");
          auto p = new Panel_ST7789();
          result->panel = p;
          {
            // auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_11;
            // cfg.pin_rst = GPIO_NUM_16;
            // p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_6, 7, 12000));
          }
        }
      };

      // https://www.adafruit.com/product/5300
      struct _detector_Feather_ESP32_S2_TFT_t : public _detector_spi_t
      {
        constexpr _detector_Feather_ESP32_S2_TFT_t(void) :
        _detector_spi_t
        { board_t::board_Feather_ESP32_S2_TFT
        , 0,0,0       // ST7789 (write only)
        , 40000000, 16000000
        , GPIO_NUM_35     // MOSI
        , (gpio_num_t)-1  // MISO
        , GPIO_NUM_36     // SCLK
        , GPIO_NUM_39     // DC
        , GPIO_NUM_7      // CS
        , GPIO_NUM_40     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , SPI2_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Feather_ESP32_S2_TFT");
          auto p = new Panel_ST7789();
          result->panel = p;
          {
            auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_7;
            // cfg.pin_rst = GPIO_NUM_40;
            cfg.panel_width  = 135;
            cfg.panel_height = 240;
            cfg.offset_x = 52;
            cfg.offset_y = 40;
            cfg.readable = false;
            cfg.rgb_order = false;
            cfg.invert = true;
            cfg.offset_rotation = 1;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_45, 0, 12000));
          }
        }
      };

      // https://www.adafruit.com/product/4985
      struct _detector_FunHouse_t : public _detector_spi_t
      {
        constexpr _detector_FunHouse_t(void) :
        _detector_spi_t
        { board_t::board_FunHouse
        , 0,0,0       // ST7789 (write only)
        , 40000000, 16000000
        , GPIO_NUM_35     // MOSI
        , (gpio_num_t)-1  // MISO
        , GPIO_NUM_36     // SCLK
        , GPIO_NUM_39     // DC
        , GPIO_NUM_40     // CS
        , GPIO_NUM_41     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , SPI2_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] FunHouse");
          auto p = new Panel_ST7789();
          result->panel = p;
          {
            auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_40;
            // cfg.pin_rst = GPIO_NUM_41;
            cfg.panel_width  = 240;
            cfg.panel_height = 240;
            cfg.readable = false;
            cfg.rgb_order = false;
            cfg.invert = true;
            cfg.offset_rotation = 2;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_21, 0, 12000));
          }
        }
      };

#elif defined (CONFIG_IDF_TARGET_ESP32C3)

      struct _detector_Makerfabs_ESP32_C3_TFT_Touch_SPI_t : public _detector_spi_t
      {
        constexpr _detector_Makerfabs_ESP32_C3_TFT_Touch_SPI_t(void) :
        _detector_spi_t
        { board_t::board_Makerfabs_ESP32_C3_TFT_Touch_SPI
        , 0x04, 0xFFFFFF, 0x668054 // ILI9488
        , 40000000, 20000000
        , GPIO_NUM_6      // MOSI
        , GPIO_NUM_7      // MISO
        , GPIO_NUM_5      // SCLK
        , GPIO_NUM_10     // DC
        , GPIO_NUM_4      // CS
        , (gpio_num_t)-1  // RST
        , GPIO_NUM_1      // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , SPI2_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Makerfabs_ESP32_C3_TFT_Touch_SPI");

          // disable pull-up for MISO pin.
          // PIN_PULLUP_DIS(IO_MUX_GPIO7_REG);

          auto p = new Panel_ILI9488();
          result->panel = p;
          {
            auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_4;
            cfg.bus_shared = true;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_8, 0, 12000));
          }

          {
            auto t = new lgfx::Touch_FT5x06();
            auto cfg = t->config();
            cfg.pin_sda  = GPIO_NUM_2;
            cfg.pin_scl  = GPIO_NUM_3;
            cfg.pin_int  = GPIO_NUM_0;
            cfg.i2c_addr = 0x38;
            cfg.i2c_port = I2C_NUM_0;
            cfg.freq = 400000;
            cfg.x_min = 0;
            cfg.x_max = 319;
            cfg.y_min = 0;
            cfg.y_max = 479;
            cfg.bus_shared = false;
            t->config(cfg);
            p->touch(t);
          }
        }
      };

#elif defined (CONFIG_IDF_TARGET_ESP32) || !defined (CONFIG_IDF_TARGET)

