lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
      #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
        // NOTE: unsure why idf v6 does not alias those
        #if !defined HSPI_HOST
          #define HSPI_HOST SPI2_HOST
        #endif
        #if !defined VSPI_HOST
          #define VSPI_HOST SPI3_HOST
        #endif
      #endif


      struct _detector_M5StickCPlus_t : public _detector_spi_t
      {
        constexpr _detector_M5StickCPlus_t(void) :
        _detector_spi_t
        { board_t::board_M5StickCPlus
        , 0x04, 0xFF, 0x85 // ST7789
        , 40000000, 15000000
        , GPIO_NUM_15     // MOSI
        , GPIO_NUM_14     // MISO
        , GPIO_NUM_13     // SCLK
        , GPIO_NUM_23     // DC
        , GPIO_NUM_5      // CS
        , GPIO_NUM_18     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5StickCPlus");

          auto p = new Panel_M5StickCPlus();
          result->panel = p;
          p->light(new Light_M5StickC());
        }
      };

      struct _detector_M5StickCPlus2_t : public _detector_spi_t
      {
        constexpr _detector_M5StickCPlus2_t(void) :
        _detector_spi_t
        { board_t::board_M5StickCPlus2
        , 0x04, 0xFF, 0x85 // ST7789
        , 40000000, 15000000
        , GPIO_NUM_15     // MOSI
        , (gpio_num_t)-1  // MISO
        , GPIO_NUM_13     // SCLK
        , GPIO_NUM_14     // DC
        , GPIO_NUM_5      // CS
        , GPIO_NUM_12     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5StickCPlus2");

          auto p = new Panel_M5StickCPlus();
          result->panel = p;
          p->light(_create_pwm_backlight(GPIO_NUM_27, 7, 256, false, 40));
        }
      };

      struct _detector_M5StickC_t : public _detector_spi_t
      {
        constexpr _detector_M5StickC_t(void) :
        _detector_spi_t
        { board_t::board_M5StickC
        , 0x04, 0xFF, 0x7C // ST7735S
        , 27000000, 14000000
        , GPIO_NUM_15     // MOSI
        , GPIO_NUM_14     // MISO
        , GPIO_NUM_13     // SCLK
        , GPIO_NUM_23     // DC
        , GPIO_NUM_5      // CS
        , GPIO_NUM_18     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5StickC");

          auto p = new Panel_M5StickC();
          result->panel = p;
          p->light(new Light_M5StickC());
        }
      };

      struct _detector_M5StackCoreInk_t : public _detector_spi_t
      {
        constexpr _detector_M5StackCoreInk_t(void)
        : _detector_spi_t
        { board_t::board_M5StackCoreInk
        , 0x70, 0xFFFFFF, 0xE00100 // e-paper GDEW0154M09
        , 40000000, 16000000
        , GPIO_NUM_23     // MOSI
        , GPIO_NUM_34     // MISO
        , GPIO_NUM_18     // SCLK
        , GPIO_NUM_15     // DC
        , GPIO_NUM_9      // CS
        , GPIO_NUM_0      // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        bool detect(_detector_result_t* result, bool use_reset) const override
        {
          // ESPがスリープしていると検出に失敗するため、リセットは必須とする;
          return _detector_spi_t::detect(result, true);
        }

        void setup(_detector_result_t* result) const override
        {
          _pin_level(GPIO_NUM_12, true);  // POWER_HOLD_PIN 12

          ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5StackCoreInk");

          auto p = new Panel_GDEW0154M09();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.panel_height = 200;
            cfg.panel_width  = 200;
            // cfg.pin_cs   = GPIO_NUM_9;
            // cfg.pin_rst  = GPIO_NUM_0;
            cfg.pin_busy = GPIO_NUM_4;
            p->config(cfg);
          }
        }
      };

      struct _detector_TTGO_TWristband_t : public _detector_spi_t
      {
        constexpr _detector_TTGO_TWristband_t(void)
        : _detector_spi_t
        { board_t::board_TTGO_TWristband
        , 0x04, 0xFF, 0x7C // ST7735
        , 27000000, 14000000
        , GPIO_NUM_19     // MOSI
        , (gpio_num_t)-1  // MISO
        , GPIO_NUM_18     // SCLK
        , GPIO_NUM_23     // DC
        , GPIO_NUM_5      // CS
        , GPIO_NUM_26     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] TTGO_TWristband");

          auto p = new Panel_ST7735S();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.dummy_read_pixel = 17;
            cfg.invert = true;
            // cfg.pin_cs  = GPIO_NUM_5;
            // cfg.pin_rst = GPIO_NUM_26;
            cfg.panel_width  = 80;
            cfg.panel_height = 160;
            cfg.offset_x     = 26;
            cfg.offset_y     = 1;
            cfg.offset_rotation = 2;
            cfg.bus_shared = false;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_27, 7, 12000));
          }
        }
      };

      // https://github.com/LilyGO/TTGO-TS
      struct _detector_TTGO_TS_t : public _detector_spi_t
      {
        constexpr _detector_TTGO_TS_t(void)
        : _detector_spi_t
        { board_t::board_TTGO_TS
        , 0x04, 0xFF, 0x7C // ST7735
        , 20000000, 14000000
        , GPIO_NUM_23     // MOSI
        , (gpio_num_t)-1  // MISO
        , GPIO_NUM_5      // SCLK
        , GPIO_NUM_17     // DC
        , GPIO_NUM_16     // CS
        , GPIO_NUM_9      // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] TTGO_TWristband");

          auto p = new Panel_ST7735S();
          result->panel = p;
          {
            auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_16;
            // cfg.pin_rst = GPIO_NUM_9;
            cfg.panel_width  = 128;
            cfg.panel_height = 160;
            cfg.offset_x     = 2;
            cfg.offset_y     = 1;
            cfg.offset_rotation = 2;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_27, 7, 12000));
          }
        }
      };

      struct _detector_ODROID_GO_t : public _detector_spi_t
      {
        constexpr _detector_ODROID_GO_t(void)
        : _detector_spi_t
        { board_t::board_ODROID_GO
        , 0x04, 0xFF, 0   // ILI9341
        , 40000000, 16000000
        , GPIO_NUM_23     // MOSI
        , GPIO_NUM_19     // MISO
        , GPIO_NUM_18     // SCLK
        , GPIO_NUM_21     // DC
        , GPIO_NUM_5      // CS
        , (gpio_num_t)-1  // RST
        , GPIO_NUM_22     // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] ODROID_GO");

          auto p = new Panel_ILI9341();
          result->panel = p;
          {
            // auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_5;
            // p->config(cfg);
            p->setRotation(1);
            p->light(_create_pwm_backlight(GPIO_NUM_14, 7));
          }
        }
      };

      struct _detector_M5Station_t : public _detector_spi_t
      {
        constexpr _detector_M5Station_t(void)
        : _detector_spi_t
        { board_t::board_M5Station
        , 0x04, 0xFF, 0x85 // ST7789
        , 40000000, 15000000
        , GPIO_NUM_23     // MOSI
        , (gpio_num_t)-1  // MISO
        , GPIO_NUM_18     // SCLK
        , GPIO_NUM_19     // DC
        , GPIO_NUM_5      // CS
        , GPIO_NUM_15     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        bool detect(_detector_result_t* result, bool use_reset) const override
        {
          using namespace m5stack;
          _pin_backup_t backup[] = { axp_i2c_sda, axp_i2c_scl };
          lgfx::i2c::init(axp_i2c_port, axp_i2c_sda, axp_i2c_scl);
          if (lgfx::i2c::readRegister8(axp_i2c_port, axp_i2c_addr, 0x03, 400000) == 0x03) // AXP192 found
          {
            if (_detector_spi_t::detect(result, use_reset))
            {
              return true;
            }
          }
          lgfx::i2c::release(axp_i2c_port);
          for (auto &b : backup)
          {
            b.restore();
          }
          return false;
        }

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5Station");

          // M5StationのLCDはM5StickCPlusと同じ;
          auto p = new Panel_M5StickCPlus();
          result->panel = p;
          {
            // auto cfg = p->config();
            // cfg.pin_rst = GPIO_NUM_15;
            // p->config(cfg);
            p->setRotation(1);
            // M5StationのバックライトはM5Toughと同じ;
            p->light(new Light_M5Tough());
          }
        }
      };

