lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
      struct _detector_M5StackCore2_t : public _detector_spi_t
      {
        constexpr _detector_M5StackCore2_t(void)
        : _detector_spi_t
        { board_t::board_M5StackCore2
        , 0x04, 0xFF, 0xE3 // ILI9342
        , 40000000, 16000000
        , GPIO_NUM_23     // MOSI
        , GPIO_NUM_38     // MISO
        , GPIO_NUM_18     // SCLK
        , GPIO_NUM_15     // DC
        , GPIO_NUM_5      // CS
        , (gpio_num_t)-1  // RST
        , GPIO_NUM_4      // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        bool detect(_detector_result_t* result, bool use_reset) const override
        {
          if (result->board && result->board != board && result->board != board_t::board_M5Tough)
          {
            return false;
          }

          using namespace m5stack;
          _pin_backup_t backup[] = { axp_i2c_sda, axp_i2c_scl };
          lgfx::i2c::init(axp_i2c_port, axp_i2c_sda, axp_i2c_scl);

          auto chk_axp = lgfx::i2c::readRegister8(axp_i2c_port, axp_i2c_addr, 0x03, 400000);
          if (chk_axp.has_value())
          {
            uint_fast16_t axp_exists = 0;
            if (chk_axp.value() == 0x03) { // AXP192 found
              axp_exists = 192;
              ESP_LOGD(LIBRARY_NAME, "AXP192 found");
            }
            else if (chk_axp.value() == 0x4A) { // AXP2101 found
              axp_exists = 2101;
              ESP_LOGD(LIBRARY_NAME, "AXP2101 found");
            }
            if (axp_exists)
            {
              // fore Core2 1st gen (AXP192)
                // AXP192_LDO2 = LCD PWR
                // AXP192_IO4  = LCD RST
                // AXP192_DC3  = LCD BL (Core2)
                // AXP192_LDO3 = LCD BL (Tough)
                // AXP192_IO1  = TP RST (Tough)
              static constexpr uint8_t reg_data_axp192_first[] = {
                0x95, 0x84, 0x72,   // GPIO4 enable
                0x28, 0xF0, 0xFF,   // set LDO2 3300mv // LCD PWR
                0x12, 0x04, 0xFF,   // LDO2 enable
                0x92, 0x00, 0xF8,   // GPIO1 OpenDrain (M5Tough TOUCH)
                0xFF, 0xFF, 0xFF,
              };
              static constexpr uint8_t reg_data_axp192_reset[] = {
                0x96, 0x00, 0xFD,   // GPIO4 LOW (LCD RST)
                0x94, 0x00, 0xFD,   // GPIO1 LOW (M5Tough TOUCH RST)
                0xFF, 0xFF, 0xFF,
              };
              static constexpr uint8_t reg_data_axp192_second[] = {
                0x96, 0x02, 0xFF,   // GPIO4 HIGH (LCD RST)
                0x94, 0x02, 0xFF,   // GPIO1 HIGH (M5Tough TOUCH RST)
                0xFF, 0xFF, 0xFF,
              };

              // for Core2 v1.1 (AXP2101)
                // ALDO2 == LCD+TOUCH RST
                // ALDO3 == SPK EN
                // ALDO4 == TF, TP, LCD PWR
                // BLDO1 == LCD BL
                // BLDO2 == Boost EN
                // DLDO1 == Vibration Motor
              static constexpr uint8_t reg_data_axp2101_first[] = {
                0x90, 0x08, 0x7B,   // ALDO4 ON / ALDO3 OFF, DLDO1 OFF
                0x80, 0x05, 0xFF,   // DCDC1 + DCDC3 ON
                0x82, 0x12, 0x00,   // DCDC1 3.3V
                0x84, 0x6A, 0x00,   // DCDC3 3.3V
                0xFF, 0xFF, 0xFF,
              };
              static constexpr uint8_t reg_data_axp2101_reset[] = {
                0x90, 0x00, 0xFD,   // ALDO2 OFF
                0xFF, 0xFF, 0xFF,
              };
              static constexpr uint8_t reg_data_axp2101_second[] = {
                0x90, 0x02, 0xFF,   // ALDO2 ON
                0xFF, 0xFF, 0xFF,
              };

              _pin_level(GPIO_NUM_5, true);

              bool isAxp192 = axp_exists == 192;

              i2c_write_register8_array(axp_i2c_port, axp_i2c_addr, isAxp192 ? reg_data_axp192_first : reg_data_axp2101_first, axp_i2c_freq);
              if (use_reset) {
                i2c_write_register8_array(axp_i2c_port, axp_i2c_addr, isAxp192 ? reg_data_axp192_reset : reg_data_axp2101_reset, axp_i2c_freq);
                lgfx::delay(1);
              }
              i2c_write_register8_array(axp_i2c_port, axp_i2c_addr, isAxp192 ? reg_data_axp192_second : reg_data_axp2101_second, axp_i2c_freq);
              lgfx::delay(1);

              result->board = board_t::board_unknown;
              if (_detector_spi_t::detect(result, use_reset))
              {
                return true;
              }
            }
          }
          lgfx::i2c::release(axp_i2c_port);
          for (auto &b : backup)
          {
            b.restore();
          }
          return false;
        }

        void setup(_detector_result_t* result) const override
        {
          using namespace m5stack;

          auto p = new Panel_M5StackCore2();
          result->panel = p;
          ITouch* t;
          // Tough のタッチコントローラ有無をチェックする;
          // Core2/Tough 判別条件としてCore2のTP(0x38)の有無を用いた場合、以下の問題が生じる;
          // ・Core2のTPがスリープしている場合は反応が得られない;
          // ・ToughにGoPlus2を組み合わせると0x38に反応がある;
          // 上記のことから、ここではToughのTP(0x2E)の有無によって判定する;
          if ( lgfx::i2c::readRegister8(axp_i2c_port, 0x2E, 0, 400000).has_value()) // 0x2E:M5Tough TOUCH
          {
            ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5Tough");
            result->board = board_t::board_M5Tough;
            p->light(new Light_M5Tough());
            t = new lgfx::Touch_M5Tough();
            p->touch(t);
          }
          else
          {
            ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5StackCore2");

            auto chk_axp = lgfx::i2c::readRegister8(axp_i2c_port, axp_i2c_addr, 0x03, 400000);
            p->light( chk_axp.value() == 0x4A // AXP2101 found
                    ? (lgfx::ILight*)(new Light_M5StackCore2_AXP2101())
                    : (lgfx::ILight*)(new Light_M5StackCore2())
                    );
            t = new lgfx::Touch_FT5x06();
            auto cfg = t->config();
            cfg.x_min = 0;
            cfg.x_max = 319;
            cfg.y_min = 0;
            cfg.y_max = 279;
            t->config(cfg);
            p->touch(t);
            // Touch 登録時に計算される標準変換式を上書きする;
            // 標準式では表示領域外の仮想ボタンの高さ分だけずれてしまう;
            float affine[6] = { 1.0f, 0.0f, 0.0f, 0.0f, 1.0f, 0.0f };
            p->setCalibrateAffine(affine);
          }
          auto cfg = t->config();
          cfg.pin_int  = GPIO_NUM_39;   // INT pin number
          cfg.pin_sda  = axp_i2c_sda;   // I2C SDA pin number
          cfg.pin_scl  = axp_i2c_scl;   // I2C SCL pin number
          cfg.i2c_port = I2C_NUM_1;// I2C port number
          cfg.freq = 400000;   // I2C freq
          cfg.bus_shared = false;
          t->config(cfg);
        }
      };

