lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
      struct _detector_Makerfabs_MakePython_t : public _detector_spi_t
      {
        constexpr _detector_Makerfabs_MakePython_t(void)
        : _detector_spi_t
        { board_t::board_Makerfabs_MakePython
        , 0x04, 0xFF, 0x85 // ST7789
        , 80000000, 14000000
        , GPIO_NUM_13     // MOSI
        , GPIO_NUM_12     // MISO
        , GPIO_NUM_14     // SCLK
        , GPIO_NUM_22     // DC
        , GPIO_NUM_15     // CS
        , GPIO_NUM_21     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Makerfabs_MakePython");

          auto p = new Panel_ST7789();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.invert = true;
            cfg.panel_height = 240;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_5, 7, 12000));
          }
        }
      };

      struct _detector_M5Stack_t : public _detector_spi_t
      {
        constexpr _detector_M5Stack_t(void)
        : _detector_spi_t
        { board_t::board_M5Stack
        , 0x04, 0xFF, 0xE3 // ILI9342
        , 40000000, 16000000
        , GPIO_NUM_23     // MOSI
        , GPIO_NUM_19     // MISO
        , GPIO_NUM_18     // SCLK
        , GPIO_NUM_27     // DC
        , GPIO_NUM_14     // CS
        , GPIO_NUM_33     // RST
        , GPIO_NUM_4      // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5Stack");

          auto p = new Panel_M5Stack();
          result->panel = p;
          p->light(_create_pwm_backlight(GPIO_NUM_32, 7, 44100));
        }
      };

      struct _detector_M5Paper_t : public _detector_spi_t
      {
        constexpr _detector_M5Paper_t(void)
        : _detector_spi_t
        { board_t::board_M5Paper
        , 0,0,0 // IT8951 独自判定ルールのため無設定;
        , 40000000, 20000000
        , GPIO_NUM_12     // MOSI
        , GPIO_NUM_13     // MISO
        , GPIO_NUM_14     // SCLK
        , (gpio_num_t)-1  // DC
        , GPIO_NUM_15     // CS
        , GPIO_NUM_23     // RST
        , GPIO_NUM_4      // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        bool detect(_detector_result_t* result, bool use_reset) const override
        {
          constexpr gpio_num_t pin_power = GPIO_NUM_2;
          constexpr gpio_num_t pin_busy = GPIO_NUM_27;

          if (result->board && result->board != board)
          {
            return false;
          }

          _pin_backup_t backup[] = { pin_power, pin_busy, pin_rst };

          _pin_reset(pin_rst, true);
          lgfx::pinMode(pin_busy, lgfx::pin_mode_t::input_pullup); // M5Paper EPD busy pin
          if (!lgfx::gpio_in(pin_busy))
          {
            _pin_level(GPIO_NUM_2, true);  // M5EPD_MAIN_PWR_PIN 2
            lgfx::pinMode(GPIO_NUM_27, lgfx::pin_mode_t::input);
            if (_detector_spi_t::detect(result, use_reset))
            {
              return true;
            }
          }
          for (auto &b : backup)
          {
            b.restore();
          }
          return false;
        }

        bool judgement(IBus* bus, int) const override
        {
          uint32_t id = lgfx::millis();
          do
          {
            vTaskDelay(1);
            if (lgfx::millis() - id > 1024) { id = 0; break; }
          } while (!lgfx::gpio_in(GPIO_NUM_27));
          if (id)
          {
            bus->beginTransaction();
            lgfx::gpio_lo(GPIO_NUM_15);
            bus->writeData(getSwap16(0x6000), 16);
            bus->writeData(getSwap16(0x0302), 16);  // read DevInfo
            id = lgfx::millis();
            bus->wait();
            lgfx::gpio_hi(GPIO_NUM_15);
            do
            {
              vTaskDelay(1);
              if (lgfx::millis() - id > 192) { break; }
            } while (!lgfx::gpio_in(GPIO_NUM_27));
            lgfx::gpio_lo(GPIO_NUM_15);
            bus->writeData(getSwap16(0x1000), 16);
            bus->writeData(getSwap16(0x0000), 16);
            uint8_t buf[40];
            bus->beginRead();
            bus->readBytes(buf, 40, false);
            bus->endRead();
            bus->endTransaction();
            lgfx::gpio_hi(GPIO_NUM_15);
            id = buf[0] << 24 | buf[1] << 16 | buf[2] << 8 | buf[3];
            // ESP_LOGV(LIBRARY_NAME, "[Autodetect] panel size :%08x", (unsigned int)id);
            if (id == 0x03C0021C)
            {
              return true;
            }
          }
          return false;
        }

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] M5Paper");

          auto p = new Panel_IT8951();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.panel_height = 540;
            cfg.panel_width  = 960;
            cfg.pin_busy = GPIO_NUM_27;
            cfg.offset_rotation = 3;
            p->config(cfg);
          }
          {
            auto t = new lgfx::Touch_GT911();
            auto cfg = t->config();
            cfg.pin_int  = GPIO_NUM_36;   // INT pin number
            cfg.pin_sda  = GPIO_NUM_21;   // I2C SDA pin number
            cfg.pin_scl  = GPIO_NUM_22;   // I2C SCL pin number
            cfg.i2c_addr = 0x14; // I2C device addr
#ifdef _M5EPD_H_
            cfg.i2c_port = I2C_NUM_0;// I2C port number
#else
            cfg.i2c_port = I2C_NUM_1;// I2C port number
#endif
            cfg.x_max = 539;
            cfg.y_max = 959;
            cfg.offset_rotation = 1;
            cfg.bus_shared = false;
            t->config(cfg);
            if (!t->init())
            {
              cfg.i2c_addr = 0x5D; // addr change (0x14 or 0x5D)
              t->config(cfg);
            }
            p->touch(t);
          }
        }
      };

