lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
      // https://github.com/Makerfabs/Project_Touch-Camera-ILI9341
      struct _detector_Makerfabs_TouchCamera_9341_t : public _detector_spi_t
      {
        constexpr _detector_Makerfabs_TouchCamera_9341_t(void)
        : _detector_spi_t
        { board_t::board_Makerfabs_TouchCamera
        , 0x04, 0xFF, 0x00 // ILI9341
        , 40000000, 16000000
        , GPIO_NUM_13     // MOSI
        , GPIO_NUM_12     // MISO
        , GPIO_NUM_14     // SCLK
        , GPIO_NUM_33     // DC
        , GPIO_NUM_15     // CS
        , (gpio_num_t)-1  // RST
        , GPIO_NUM_4      // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        bool detect(_detector_result_t* result, bool use_reset) const override
        {
          // ESP32_2432S028 とSPIピンやパネル種類に共通点が多く誤判定しやすい。
          // そこで ESP32_2432S028 のD/CピンであるGPIO2をHIGHにすることで誤判定を防止する
          _pin_backup_t backup = { GPIO_NUM_2 };
          _pin_level(GPIO_NUM_2, true);
          bool res = _detector_spi_t::detect(result, use_reset);
          backup.restore();
          return res;
        }

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Makerfabs_TouchCamera (ILI9341)");

          auto p = new Panel_ILI9341();
          result->panel = p;

          {
            auto t = new lgfx::Touch_STMPE610();
            auto cfg = t->config();
            cfg.bus_shared = true;
            cfg.spi_host = spi_host;
            cfg.pin_int  = GPIO_NUM_0;
            cfg.pin_cs   = GPIO_NUM_2;
            cfg.pin_mosi = pin_mosi;
            cfg.pin_miso = pin_miso;
            cfg.pin_sclk = pin_sclk;
            cfg.offset_rotation = 2;
            t->config(cfg);
            p->touch(t);
          }
        }
      };

      // https://github.com/Makerfabs/Project_Touch-Screen-Camera
      struct _detector_Makerfabs_TouchCamera_9488_t : public _detector_spi_t
      {
        constexpr _detector_Makerfabs_TouchCamera_9488_t(void)
        : _detector_spi_t
        { board_t::board_Makerfabs_TouchCamera
        , 0x04, 0xFF, 0x54 // ILI9488
        , 40000000, 16000000
        , GPIO_NUM_13     // MOSI
        , GPIO_NUM_12     // MISO
        , GPIO_NUM_14     // SCLK
        , GPIO_NUM_33     // DC
        , GPIO_NUM_15     // CS
        , (gpio_num_t)-1  // RST
        , GPIO_NUM_4      // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Makerfabs_TouchCamera (ILI9488)");

          auto p = new Panel_ILI9488();
          result->panel = p;

          if (lgfx::i2c::init(I2C_NUM_1, GPIO_NUM_26, GPIO_NUM_27).has_value())
          {
            ITouch* t = nullptr;
            ITouch::config_t cfg;
            if (!lgfx::i2c::readRegister8(I2C_NUM_1, 0x38, 0, 400000).has_value()) // 0x48:NS2009
            {
              t = new lgfx::Touch_NS2009();
              cfg = t->config();
              cfg.x_min = 460;
              cfg.x_max = 3680;
              cfg.y_min = 150;
              cfg.y_max = 3780;
              cfg.pin_int  = GPIO_NUM_0;   // INT pin number
            }
            else
            {
              t = new lgfx::Touch_FT5x06();
              cfg = t->config();
              cfg.x_max = 319;
              cfg.y_max = 479;
            // cfg.pin_int  = GPIO_NUM_0;   // INT pin number (board ver1.1 doesn't work)
            }
            cfg.bus_shared = false;
            cfg.pin_sda  = GPIO_NUM_26;   // I2C SDA pin number
            cfg.pin_scl  = GPIO_NUM_27;   // I2C SCL pin number
            cfg.i2c_port = I2C_NUM_1;// I2C port number
            t->config(cfg);
            p->touch(t);
          }
        }
      };

      struct _detector_board_LoLinD32_7735_t : public _detector_spi_t
      {
        constexpr _detector_board_LoLinD32_7735_t(void)
        : _detector_spi_t
        { board_t::board_LoLinD32
        , 0x04, 0xFF, 0x7C // ST7735
        , 27000000, 16000000
        , GPIO_NUM_23     // MOSI
        , GPIO_NUM_19     // MISO
        , GPIO_NUM_18     // SCLK
        , GPIO_NUM_27     // DC
        , GPIO_NUM_14     // CS
        , GPIO_NUM_33     // RST
        , GPIO_NUM_4      // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] LoLinD32 (ST7735)");

          auto p = new Panel_ST7735S();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.memory_width  = 132;
            cfg.memory_height = 132;
            cfg.panel_width  = 128;
            cfg.panel_height = 128;
            cfg.offset_x = 2;
            cfg.offset_y = 1;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_32, 7, 44100));
          }
        }
      };

      struct _detector_board_LoLinD32_9341_t : public _detector_spi_t
      {
        constexpr _detector_board_LoLinD32_9341_t(void)
        : _detector_spi_t
        { board_t::board_LoLinD32
        , 0x04, 0xFF, 0x00 // ILI9341
        , 40000000, 16000000
        , GPIO_NUM_23     // MOSI
        , GPIO_NUM_19     // MISO
        , GPIO_NUM_18     // SCLK
        , GPIO_NUM_27     // DC
        , GPIO_NUM_14     // CS
        , GPIO_NUM_33     // RST
        , GPIO_NUM_4      // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] LoLinD32 (ILI9341)");

          auto p = new Panel_ILI9341();
          result->panel = p;
          p->light(_create_pwm_backlight(GPIO_NUM_32, 7, 44100));

          {
            auto t = new lgfx::Touch_XPT2046();
            auto cfg = t->config();
            cfg.bus_shared = true;
            cfg.spi_host = spi_host;
            cfg.pin_cs   = GPIO_NUM_12;
            cfg.pin_mosi = pin_mosi;
            cfg.pin_miso = pin_miso;
            cfg.pin_sclk = pin_sclk;
            cfg.offset_rotation = 2;
            t->config(cfg);
            p->touch(t);
          }
        }
      };

