lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
      struct _detector_ESP_WROVER_KIT_9341_t : public _detector_spi_t
      {
        constexpr _detector_ESP_WROVER_KIT_9341_t(void)
        : _detector_spi_t
        { board_t::board_ESP_WROVER_KIT
        , 0x04, 0xFF, 0x00 // ILI9341
        , 40000000, 20000000
        , GPIO_NUM_23     // MOSI
        , GPIO_NUM_25     // MISO
        , GPIO_NUM_19     // SCLK
        , GPIO_NUM_21     // DC
        , GPIO_NUM_22     // CS
        , GPIO_NUM_18     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] ESP_WROVER_KIT (ILI9341)");

          auto p = new Panel_ILI9341();
          result->panel = p;
          p->light(_create_pwm_backlight(GPIO_NUM_5, 7, 12000, true));
        }
      };

      struct _detector_ESP_WROVER_KIT_7789_t : public _detector_spi_t
      {
        constexpr _detector_ESP_WROVER_KIT_7789_t(void)
        : _detector_spi_t
        { board_t::board_ESP_WROVER_KIT
        , 0x04, 0xFF, 0x85 // ST7789
        , 80000000, 16000000
        , GPIO_NUM_23     // MOSI
        , GPIO_NUM_25     // MISO
        , GPIO_NUM_19     // SCLK
        , GPIO_NUM_21     // DC
        , GPIO_NUM_22     // CS
        , GPIO_NUM_18     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , VSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] ESP_WROVER_KIT (ST7789)");

          auto p = new Panel_ST7789();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.offset_rotation = 2;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_5, 7, 12000, true));
          }
        }
      };

      struct _detector_Sunton_ESP32_2432S028_t : public _detector_spi_t
      {
        constexpr _detector_Sunton_ESP32_2432S028_t
        ( board_t board_
        , uint16_t id_cmd_
        , uint32_t id_mask_
        , uint32_t id_value_
        , uint32_t freq_write_
        , uint32_t freq_read_
        , gpio_num_t pin_mosi_
        , gpio_num_t pin_miso_
        , gpio_num_t pin_sclk_
        , gpio_num_t pin_dc_
        , gpio_num_t pin_cs_
        , gpio_num_t pin_rst_
        , gpio_num_t pin_tfcard_cs_
        , int8_t spi_mode_
        , bool spi_3wire_
        , spi_host_device_t spi_host_
        ) :
        _detector_spi_t { board_, id_cmd_, id_mask_, id_value_, freq_write_, freq_read_,
                          pin_mosi_, pin_miso_, pin_sclk_, pin_dc_, pin_cs_, pin_rst_, pin_tfcard_cs_,
                          spi_mode_, spi_3wire_, spi_host_ }
        {}

        bool detect(_detector_result_t* result, bool use_reset) const override
        {
          // Makerfabs_TouchCamera とSPIピンやパネル種類に共通点が多く誤判定しやすい。
          // そこで Makerfabs_TouchCamera のD/CピンであるGPIO33をHIGHにすることで誤判定を防止する
          _pin_backup_t backup = { GPIO_NUM_33 };
          _pin_level(GPIO_NUM_33, true);
          bool res = _detector_spi_t::detect(result, use_reset);
          backup.restore();
          return res;
        }

        void setup(_detector_result_t* result) const override
        {
          auto p = result->panel;
          {
            auto cfg = p->config();
            cfg.bus_shared = false;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_21, 7));
          }

          {
            auto t = new lgfx::Touch_XPT2046();
            auto cfg = t->config();
            cfg.x_min      =  300;
            cfg.x_max      = 3900;
            cfg.y_min      = 3700;
            cfg.y_max      =  200;
            cfg.pin_int    = -1;
            cfg.bus_shared = false;
            cfg.spi_host = -1; // -1:use software SPI for XPT2046
            cfg.pin_sclk = GPIO_NUM_25;
            cfg.pin_mosi = GPIO_NUM_32;
            cfg.pin_miso = GPIO_NUM_39;
            cfg.pin_cs   = GPIO_NUM_33;
            t->config(cfg);
            p->touch(t);
          }
        }
      };

      struct _detector_Sunton_2432S028_9341_t : public _detector_Sunton_ESP32_2432S028_t
      {
        constexpr _detector_Sunton_2432S028_9341_t(void)
        : _detector_Sunton_ESP32_2432S028_t
        { board_t::board_Sunton_ESP32_2432S028
        , 0x04, 0xFF, 0x00 // ILI9341
        , 40000000, 16000000
        , GPIO_NUM_13     // MOSI
        , GPIO_NUM_12     // MISO
        , GPIO_NUM_14     // SCLK
        , GPIO_NUM_2      // DC
        , GPIO_NUM_15     // CS
        , (gpio_num_t)-1  // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Sunton_2432S028 (ILI9341)");

          auto p = new Panel_ILI9341();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.offset_rotation = 2;
            p->config(cfg);
          }
          _detector_Sunton_ESP32_2432S028_t::setup(result);
        }
      };

      struct _detector_Sunton_2432S028_7789_t : public _detector_Sunton_ESP32_2432S028_t
      {
        constexpr _detector_Sunton_2432S028_7789_t(void)
        : _detector_Sunton_ESP32_2432S028_t
        { board_t::board_Sunton_ESP32_2432S028
        , 0x04, 0xFF, 0x85 // ST7789
        , 80000000, 16000000
        , GPIO_NUM_13     // MOSI
        , GPIO_NUM_12     // MISO
        , GPIO_NUM_14     // SCLK
        , GPIO_NUM_2      // DC
        , GPIO_NUM_15     // CS
        , (gpio_num_t)-1  // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Sunton_2432S028 (ST7789)");

          result->panel = new Panel_ST7789();
          _detector_Sunton_ESP32_2432S028_t::setup(result);
          auto t = result->panel->getTouch();
          {
            auto cfg = t->config();
            cfg.offset_rotation = 2;
            t->config(cfg);
          }
        }
      };

      struct _detector_Guition_JC2432W328C_t : public _detector_Sunton_ESP32_2432S028_t
      {
        constexpr _detector_Guition_JC2432W328C_t(void)
        : _detector_Sunton_ESP32_2432S028_t
        { board_t::board_Guition_ESP32_2432W328
        , 0x04, 0xFFFF00, 0xb38100
        , 55000000, 20000000
        , GPIO_NUM_13     // MOSI
        , GPIO_NUM_12     // MISO
        , GPIO_NUM_14     // SCLK
        , GPIO_NUM_2      // DC
        , GPIO_NUM_15     // CS
        , (gpio_num_t)-1  // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] Guition_JC2432W328C");

          result->panel = new Panel_ILI9341_2();

          auto p = result->panel;
          {
            auto cfg = p->config();
            cfg.offset_x         =     0;
            cfg.offset_y         =     0;
            cfg.offset_rotation  =     6;
            cfg.dummy_read_pixel =     8;
            cfg.dummy_read_bits  =     1;
            cfg.readable         = true;
            cfg.invert           = true;
            cfg.rgb_order        = false;
            cfg.dlen_16bit       = false;
            cfg.bus_shared       = false;
            p->config(cfg);

            p->light(_create_pwm_backlight(GPIO_NUM_27, 7));
          }
          {
              auto t = new lgfx::Touch_CST816S();

              auto cfg = t->config();
              cfg.i2c_port = I2C_NUM_0;
              cfg.pin_sda = GPIO_NUM_33;
              cfg.pin_scl = GPIO_NUM_32;
              cfg.pin_rst = GPIO_NUM_25;
              cfg.pin_int = -1;
              cfg.offset_rotation = 6;
              cfg.freq = 400000;
              cfg.x_max = 240;
              cfg.y_max = 320;
              t->config(cfg);
              p->touch(t);
          }
        }
      };

