lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
      struct _detector_WT32_SC01_t : public _detector_spi_t
      {
        constexpr _detector_WT32_SC01_t(void)
        : _detector_spi_t
        { board_t::board_WT32_SC01
        , 0,0,0       // (write only)
        , 40000000, 16000000
        , GPIO_NUM_13     // MOSI
        , (gpio_num_t)-1  // MISO
        , GPIO_NUM_14     // SCLK
        , GPIO_NUM_21     // DC
        , GPIO_NUM_15     // CS
        , GPIO_NUM_22     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , true            // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        bool judgement(IBus* bus, int pin_cs_) const override
        {
          // タッチパネルの有無をチェックする;
          _pin_backup_t backup[] = { GPIO_NUM_18, GPIO_NUM_19 };
          lgfx::i2c::init(I2C_NUM_1, GPIO_NUM_18, GPIO_NUM_19);
          // I2C通信でタッチパネルコントローラが存在するかチェックする
          if (0x11 == lgfx::i2c::readRegister8(I2C_NUM_1, 0x38, 0xA8, 400000))
          { /// FocalTech's Panel ID reg=0xA8  value=0x11
            return true;
          }
          lgfx::i2c::release(I2C_NUM_1);
          for (auto &b : backup)
          {
            b.restore();
          }
          return false;
        }

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] WT32_SC01");

          auto p = new Panel_ST7796();
          result->panel = p;
          {
            auto cfg = p->config();
            // cfg.pin_cs  = GPIO_NUM_15;
            // cfg.pin_rst = GPIO_NUM_22;
            cfg.readable  = false;
            cfg.bus_shared = false;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_23, 7));
          }

          {
            auto t = new lgfx::Touch_FT5x06();
            auto cfg = t->config();
            cfg.pin_int  = GPIO_NUM_39;   // INT pin number
            cfg.pin_sda  = GPIO_NUM_18;   // I2C SDA pin number
            cfg.pin_scl  = GPIO_NUM_19;   // I2C SCL pin number
            cfg.i2c_port = I2C_NUM_1;// I2C port number
            cfg.x_max = 319;
            cfg.y_max = 479;
            cfg.bus_shared = false;
            t->config(cfg);
            p->touch(t);
          }
        }
      };

      struct _detector_DDUINO32_XS_t : public _detector_spi_t
      {
        constexpr _detector_DDUINO32_XS_t(void)
        : _detector_spi_t
        { board_t::board_DDUINO32_XS
        , 0,0,0       // ST7789 (write only)
        , 80000000, 16000000
        , GPIO_NUM_26     // MOSI
        , (gpio_num_t)-1  // MISO
        , GPIO_NUM_27     // SCLK
        , GPIO_NUM_23     // DC
        , (gpio_num_t)-1  // CS
        , GPIO_NUM_32     // RST
        , (gpio_num_t)-1  // TF CARD CS
        , 0               // SPI MODE
        , false           // SPI 3wire
        , HSPI_HOST       // SPI HOST
        } {}

        void setup(_detector_result_t* result) const override
        {
          ESP_LOGI(LIBRARY_NAME, "[Autodetect] DDUINO32_XS");

          auto p = new Panel_ST7789();
          result->panel = p;
          {
            auto cfg = p->config();
            cfg.panel_height = 240;
            cfg.invert = true;
            cfg.readable  = false;
            cfg.bus_shared = false;
            p->config(cfg);
            p->light(_create_pwm_backlight(GPIO_NUM_22, 7));
          }
        }
      };

#endif

      const _detector_t* const* detectors = nullptr;

#if defined (CONFIG_IDF_TARGET_ESP32S3)

      static constexpr const _detector_M5AtomS3_t                                detector_M5AtomS3;
      static constexpr const _detector_M5StackCoreS3_t                           detector_M5StackCoreS3;
      static constexpr const _detector_ESP32_S3_BOX_t                            detector_ESP32_S3_BOX;
      static constexpr const _detector_ESP32_S3_BOX_Lite_t                       detector_ESP32_S3_BOX_Lite;
      static constexpr const _detector_ESP32_S3_BOX_V3_t                         detector_ESP32_S3_BOX_V3;
      static constexpr const _detector_Makerfabs_ESP32_S3_TFT_Touch_SPI_t        detector_Makerfabs_ESP32_S3_TFT_Touch_SPI;
      static constexpr const _detector_Makerfabs_ESP32_S3_TFT_Touch_Parallel16_t detector_Makerfabs_ESP32_S3_TFT_Touch_Parallel16;
      static constexpr const _detector_wywy_ESP32S3_HMI_DevKit_t                 detector_wywy_ESP32S3_HMI_DevKit;
      static constexpr const _detector_Feather_ESP32_S3_TFT_t                    detector_Feather_ESP32_S3_TFT;
      static constexpr const _detector_board_LoLinS3Pro_7735_t                   detector_board_LoLinS3Pro_7735;
      static constexpr const _detector_board_LoLinS3Pro_9341_t                   detector_board_LoLinS3Pro_9341;

      static constexpr const _detector_t* detector_list[] =
      {

#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_M5ATOMS3 ) || defined ( LGFX_M5ATOM_S3LCD )
        &detector_M5AtomS3,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_M5STACK_CORES3 )
        &detector_M5StackCoreS3,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_ESP32_S3_BOX )
        &detector_ESP32_S3_BOX,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_ESP32_S3_BOX_LITE )
        &detector_ESP32_S3_BOX_Lite,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_ESP32_S3_BOX_V3 )
        &detector_ESP32_S3_BOX_V3,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_MAKERFABS_TFT_TOUCH_SPI )
        &detector_Makerfabs_ESP32_S3_TFT_Touch_SPI,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_MAKERFABS_TFT_TOUCH_PARALLEL16 )
        &detector_Makerfabs_ESP32_S3_TFT_Touch_Parallel16,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_WYWY_ESP32S3_HMI_DEVKIT )
        &detector_wywy_ESP32S3_HMI_DevKit,
#endif

// Feather S3 TFT screen is write-only, no LGFX_AUTODETECT
#if defined ( LGFX_FEATHER_ESP32_S3_TFT )
        &detector_Feather_ESP32_S3_TFT,
#endif

#if defined( LGFX_LOLIN_S3_PRO )
        &detector_board_LoLinS3Pro_7735,
        &detector_board_LoLinS3Pro_9341,
#endif

        nullptr // terminator
      };

