lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
      detectors = detector_list;

#elif defined (CONFIG_IDF_TARGET_ESP32S2)

      static constexpr const _detector_ESP32_S2_Kaluga_1_t                        detector_ESP32_S2_Kaluga_1;
      static constexpr const _detector_Makerfabs_ESP32_S2_TFT_Touch_Parallel16_t  detector_Makerfabs_ESP32_S2_TFT_Touch_Parallel16;
      static constexpr const _detector_Feather_ESP32_S2_TFT_t                     detector_Feather_ESP32_S2_TFT;
      static constexpr const _detector_FunHouse_t                                 detector_FunHouse;

      static constexpr const _detector_t* detector_list[] =
      {

#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_ESP32_S2_KALUGA_1 )
        &detector_ESP32_S2_Kaluga_1,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_MAKERFABS_TFT_TOUCH_PARALLEL16 )
        &detector_Makerfabs_ESP32_S2_TFT_Touch_Parallel16,
#endif

// Feather S2 TFT screen is write-only, no LGFX_AUTODETECT
#if defined ( LGFX_FEATHER_ESP32_S2_TFT )
        &detector_Feather_ESP32_S2_TFT,
#endif
// FunHouse screen is write-only, no LGFX_AUTODETECT
#if defined ( LGFX_FUNHOUSE )
        &detector_FunHouse,
#endif

        nullptr // terminator
      };

      detectors = detector_list;

#elif defined (CONFIG_IDF_TARGET_ESP32C3)

      static constexpr const _detector_Makerfabs_ESP32_C3_TFT_Touch_SPI_t        detector_Makerfabs_ESP32_C3_TFT_Touch_SPI;

      static constexpr const _detector_t* detector_list[] =
      {

#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_MAKERFABS_TFT_TOUCH_SPI )
        &detector_Makerfabs_ESP32_C3_TFT_Touch_SPI,
#endif

        nullptr // terminator
      };

      detectors = detector_list;

#elif defined (CONFIG_IDF_TARGET_ESP32) || !defined (CONFIG_IDF_TARGET)

      static constexpr const _detector_M5StickC_t              detector_M5StickC;
      static constexpr const _detector_M5StickCPlus_t          detector_M5StickCPlus;
      static constexpr const _detector_M5StickCPlus2_t         detector_M5StickCPlus2;
      static constexpr const _detector_M5StackCoreInk_t        detector_M5StackCoreInk;
      static constexpr const _detector_TTGO_TWristband_t       detector_TTGO_TWristband;
      static constexpr const _detector_TTGO_TS_t               detector_TTGO_TS;

      static constexpr const _detector_M5Station_t             detector_M5Station;
      static constexpr const _detector_M5StackCore2_t          detector_M5StackCore2; // and M5Tough
      static constexpr const _detector_TTGO_TWatch_t           detector_TTGO_TWatch;
      static constexpr const _detector_TTGO_TDisplay_t         detector_TTGO_TDisplay;
      static constexpr const _detector_TTGO_T4_Display_t       detector_TTGO_T4_Display;
      static constexpr const _detector_WiFiBoy_Mini_t          detector_WiFiBoy_Mini;
      static constexpr const _detector_WiFiBoy_Pro_t           detector_WiFiBoy_Pro;
      static constexpr const _detector_Makerfabs_MakePython_t  detector_Makerfabs_MakePython;
      static constexpr const _detector_M5Stack_t               detector_M5Stack;
      static constexpr const _detector_M5Paper_t               detector_M5Paper;

      static constexpr const _detector_Makerfabs_TouchCamera_9341_t detector_Makerfabs_TouchCamera_9341;
      static constexpr const _detector_Makerfabs_TouchCamera_9488_t detector_Makerfabs_TouchCamera_9488;
      static constexpr const _detector_board_LoLinD32_7735_t   detector_board_LoLinD32_7735;
      static constexpr const _detector_board_LoLinD32_9341_t   detector_board_LoLinD32_9341;
      static constexpr const _detector_ESP_WROVER_KIT_7789_t   detector_ESP_WROVER_KIT_7789;
      static constexpr const _detector_ESP_WROVER_KIT_9341_t   detector_ESP_WROVER_KIT_9341;
      static constexpr const _detector_Guition_JC2432W328C_t   detector_Guition_JC2432W328C;
      static constexpr const _detector_Sunton_2432S028_9341_t  detector_Sunton_2432S028_9341;
      static constexpr const _detector_Sunton_2432S028_7789_t  detector_Sunton_2432S028_7789;
      static constexpr const _detector_ODROID_GO_t             detector_ODROID_GO;
      static constexpr const _detector_WT32_SC01_t             detector_WT32_SC01;

      static constexpr const _detector_DDUINO32_XS_t           detector_DDUINO32_X;

      static constexpr const _detector_t* detector_list_PICO_V3[] =
      {

#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_M5STICK_C ) || defined ( LGFX_M5STICKC )
        &detector_M5StickCPlus2,
#endif
        nullptr // terminator
      };

      static constexpr const _detector_t* detector_list_PICO_D4[] =
      {

#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_M5STACK_COREINK )
        &detector_M5StackCoreInk,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_M5STICK_C ) || defined ( LGFX_M5STICKC )
        &detector_M5StickCPlus,
        &detector_M5StickC,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_TTGO_TWRISTBAND )
        &detector_TTGO_TWristband,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_TTGO_TS )
        &detector_TTGO_TS,
#endif
        nullptr // terminator
      };

      static constexpr const _detector_t* detector_list_D0WDQ5[] =
      {
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_MAKERFABS_TOUCHCAMERA )
        &detector_Makerfabs_TouchCamera_9488,
        &detector_Makerfabs_TouchCamera_9341,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_LOLIN_D32_PRO )
        &detector_board_LoLinD32_7735,
        &detector_board_LoLinD32_9341,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_ESP_WROVER_KIT )
        &detector_ESP_WROVER_KIT_7789,
        &detector_ESP_WROVER_KIT_9341,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_ESP32_2432W328 ) || defined ( LGFX_GUITION_ESP32_2432W328 )
        &detector_Guition_JC2432W328C,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_ESP32_2432S028 ) || defined ( LGFX_SUNTON_ESP32_2432S028 )
        &detector_Sunton_2432S028_9341,
        &detector_Sunton_2432S028_7789,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_ODROID_GO )
        &detector_ODROID_GO,
#endif

  // WT32_SC01 は読出しが出来ない製品だがタッチパネルの有無で判定する。;
  // LGFX_AUTO_DETECTでは機能しないようにしておく。;
#if defined ( LGFX_WT32_SC01 )
        &detector_WT32_SC01,
#endif
  // DSTIKE D-Duino32XS については読出しが出来ないため無条件設定となる。;
  // そのためLGFX_AUTO_DETECTでは機能しないようにしておく。;
#if defined ( LGFX_DDUINO32_XS )
        &detector_DDUINO32_X,
#endif

        nullptr // terminator
      };

