lovyan03/LovyanGFX/src/lgfx/v1_autodetect/LGFX_AutoDetect_ESP32_all.hpp
      static constexpr const _detector_t* detector_list_D0WDQ6[] =
      {
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_M5STATION )
        &detector_M5Station,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_M5STACK_CORE2 ) || defined ( LGFX_M5STACKCORE2 ) || defined ( LGFX_M5TOUGH )
        &detector_M5StackCore2,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_TTGO_TWATCH )
        &detector_TTGO_TWatch,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_TTGO_TDISPLAY )
        &detector_TTGO_TDisplay,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_TTGO_T4_DISPLAY )
        &detector_TTGO_T4_Display,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_WIFIBOY_MINI )
        &detector_WiFiBoy_Mini,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_WIFIBOY_PRO )
        &detector_WiFiBoy_Pro,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_MAKERFABS_MAKEPYTHON )
        &detector_Makerfabs_MakePython,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_M5STACK )
        &detector_M5Stack,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_M5PAPER )
        &detector_M5Paper,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_ODROID_GO )
        &detector_ODROID_GO,
#endif
#if defined ( LGFX_AUTODETECT ) || defined ( LGFX_ESP32_2432S028 ) || defined ( LGFX_SUNTON_ESP32_2432S028 )
        &detector_Sunton_2432S028_9341,
        &detector_Sunton_2432S028_7789,
#endif

        nullptr // terminator
      };


      uint32_t pkg_ver = lgfx::get_pkg_ver();
      ESP_LOGV("LGFX", "pkg: %lu", (unsigned long)pkg_ver);

      switch (pkg_ver)
      {
      case EFUSE_RD_CHIP_VER_PKG_ESP32D0WDQ5:
        detectors = detector_list_D0WDQ5;
        break;

      case EFUSE_RD_CHIP_VER_PKG_ESP32D0WDQ6:
        detectors = detector_list_D0WDQ6;
        break;

      default:
      case EFUSE_RD_CHIP_VER_PKG_ESP32PICOD4:
        detectors = detector_list_PICO_D4;
        break;

      case 6:
        detectors = detector_list_PICO_V3;
        break;
      }

#endif

      panel(nullptr);

      if (_panel_last)
      {
        delete _panel_last;
        _panel_last = nullptr;
      }
      if (_light_last)
      {
        delete _light_last;
        _light_last = nullptr;
      }
      if (_touch_last)
      {
        delete _touch_last;
        _touch_last = nullptr;
      }
      if (_bus_last)
      {
        _bus_last->release();
        delete _bus_last;
        _bus_last = nullptr;
      }

      _detector_result_t result;
      while (*detectors != nullptr)
      {
        auto detector = *detectors++;

        result.board = board;
        if (detector->detect(&result, use_reset))
        {
          _bus_last = result.bus;
          auto p = result.panel;
          _touch_last = p->touch();
          _light_last = p->light();
          _panel_last = p;
          setPanel(p);
          return result.board;
        }
      }

      return board_t::board_unknown;
    }
  };

//----------------------------------------------------------------------------
 }
}

using LGFX = lgfx::LGFX;
